/* No comment provided by engineer. */
"Authenticating as {0}" = "المصادقة كا {0}";
"Calculate checksum for {0}" = "Calculate checksum for {0}";

"Deleting {0}" = "الحذف {0}";
"Disconnected" = "قُطع الأتصال";
"Disconnecting {0}" = "جاري قطع الآتصال {0}";
"Downloading {0}" = "جاري التحميل {0}";
/* Connection type opened */
"{0} connection opened" = "{0} الأتصال فُتح";

/* Reading size of file. */
"Getting size of {0}" = "الحصول على حجم من {0}";

/* Reading modification date of file. */
"Getting timestamp of {0}" = "الحصول على طابع زمني من {0}";

/* Reading permission of file. */
"Getting permission of {0}" = "الحصول على إذن من {0}";

/* No activity */
"Idle" = "Idle";
"Listing directory {0}" = "سرد الدليل {0}";
"Making directory {0}" = "جعل الدليل {0}";
"Maximum allowed connections exceeded. Waiting" = "تجاوز الحد الأقصى الاتصالات المسموح بها. انتظار ...";
"Mounting {0}" = "Mounting {0}";

/* The user did not accept the certificate or is not valid */
"No trusted certificate found" = "No trusted certificate found";
"Opening {0} connection to {1}" = "أفتتاح {0} الأتصال إلى {1}";
"SFTP subsystem ready" = "SFTP subsystem ready";
"SCP subsystem ready" = "SCP subsystem ready";
"Starting SFTP subsystem" = "Starting SFTP subsystem";
"Starting SCP subsystem" = "Starting SCP subsystem";
"Uploading {0}" = "جاري الرفع {0}";

/* Renaming file status message; Renaming to <new filename>. */
"Renaming {0} to {1}" = "تغيير الأسم {0} إلى {1}";

/* Duplicate a file */
"Copying {0} to {1}" = "نسخ {0} إلى {1}";

/* Changing the owner of a file */
"Changing owner of {0} to {1}" = "تغيير المالك من {0} إلى {1}";

/* Changing the group owner of a file */
"Changing group of {0} to {1}" = "تغيير المجموعة من {0} إلى {1}";

/* Changing UNIX file permissions */
"Changing permission of {0} to {1}" = "تغيير الصلاحيات من {0} إلى {1}";
"Changing timestamp of {0} to {1}" = "Changing timestamp of {0} to {1}";

/* Indicates remaining time needed for files to transfer */
"{0} seconds remaining" = "{0} ثواني متبقية";

/* Indicates remaining time needed for files to transfer */
"{0} minutes remaining" = "{0} دقائق متبقية";

/* Indicates remaining time needed for files to transfer */
"{0} hours remaining" = "{0} ساعات متبقية";

/* When trying to determine the IP address of a server hostname; e.g. Resolving example.net */
"Resolving {0}" = "حل {0}";

/* Retry in 10 seconds - Used to indicate the time left until another connection attempt is made */
"Retry again in {0} seconds ({1} more attempts)" = "إعادة المحاولة مرة أخرى بعد {0} ثانية ({1} محاولات أكثر)";
"Transfer complete" = "النقل أكتمل";
"Transfer incomplete" = "النقل لم يكتمل";

/* Content distribution network (CDN) */
"Enable {0} Distribution" = "فعّل {0} النشر";
"Disable {0} Distribution" = "عطل {0} النشر";

/* Compress and expand archives */
"Archiving {0}" = "أرشفت {0}";
"Unarchiving {0}" = "غير مؤرشف {0}";

/* Compute MD5 hash */
"Compute MD5 hash of {0}" = "Compute MD5 hash of {0}";

/* Reading HTTP headers */
"Reading metadata of {0}" = "Reading metadata of {0}";

/* Writing custom HTTP headers */
"Writing metadata of {0}" = "Writing metadata of {0}";

/* Prepare path for transfer */
"Prepare {0} ({1})" = "جهّز {0} ({1})";

/* Content distribution network (CDN) configuration */
"Reading CDN configuration of {0}" = "Reading CDN configuration of {0}";
"Writing CDN configuration of {0}" = "Writing CDN configuration of {0}";

/* Growl Notification */
"Connection failed" = "فشل الأتصال";

/* Growl Notification */
"Connection opened" = "الأتصال فُتح";

/* Growl Notification */
"Download complete" = "أكتمل التحميل";

/* Growl Notification */
"Synchronization complete" = "أكتمل التزامن";

/* Growl Notification */
"Upload complete" = "أكتمل الرفع";

/* Growl Notification */
"Download failed" = "فشل التحميل";

/* Growl Notification */
"Upload failed" = "فشل الرفع";

/* Growl Notification */
"Transfer queued" = "قائمة الأنتظار للنقل";
